package syntax;
/*
 * @ Date	: 20150630
 * @ Author : 최승현
 * @ Story	: 자료구조의  정의와 종류
 */
public class DataStructure {
	/*
	 * [1] 자료구조 ?
	 * - 자료구조란 데이터를 효율적으로 사용할 수 있도록
	 *    구조를 만들어서 저장해둔 것
	 * [2] 데이터의 효율적 사용 ?
	 * - DB 의 CRUD ( create, read, update, delete 의 약자 )
	 * - 데이터 추가, 수정, 삭제, 검색에 있어서의 효율적 사용
	 * 
	 * [3] 자료구조의 종류(총 4가지)
	 * - 리스트
	 * - 스택
	 * - 큐
	 * - 해쉬 테이블
	 * 
	 * 
	 * 
	 * 1. 리스트(list)
	 *   - 데이터를 1차원으로 늘어놓은 형태의 자료구조
	 *   - 리스트는 배열과는 달리 데이터의 검색과 추가, 삭제가 가능(별도 메소드를 가짐)
	 *   - 데이터를 저장하는 형태에 따라
	 *   - 배열리스트(ArrayList)
	 *   - 연결 리스트(LinkedList)
	 *   - 2가지로 나눕니다.
	 *   
	 * 2. 스택 & 큐
	 *   - 리스트처럼 1차원 구조를 가지면서
	 *   - 데이터릐 추가/삭제 순서를 특정함(한정지름)
	 *   
	 * 스택(stack)
	 *   - 엘리베이터에 사람이 타는 것 처럼
	 *   - 제일 마지막에 넣은 데이터부터 순서대로 꺼내는 구조
	 * 큐(queue)
	 *   - 큐는 스택과는 반대로 매표소에 줄을 서서 기다리는 사람들처럼
	 *   - 들어온 순서대로 데이터를 꺼낼 수 있는 자료구조
	 *   
	 * 3. 해쉬테이블(Hash Table)
	 *   - 데이터를 키(key)로 검색하는 것이 가능
	 *   - 번호가 붙은 여러 개의 틈에 데이터를 분산 저장
	 *   - 빠른 데이터 검색이 가능하다는 장점
	 *   
	 * 4. 타입 파라미터
	 *   - 자료구조 클래스 이름 뒤쪽에 <E> <K, V> 을 말함.
	 *   - 이 부분은 자료구조에 저장할 데이터의 타입을 써넣는 부분.
	 *   - 자료구조에 저장할 수 있는 데이터의 타입을 제한하는 역할
	 */
}
