package syntax;
/*
 * @ Date	: 20150702
 * @ Author : 최승현
 * @ Story	: 쓰레드(Thread) 문법
 */
public class ThreadSyntax {
	/*
	 * Thread
	 * 직렬 프로그램
	 * 병렬 프로그램
	 * 현재  우리가 배운 과정상에서 프로그램을 돌리면(CTRL + F11)
	 * 음악이 꺼져야 악기를 등록할 수 있습니다.
	 * 그런데, 병렬처리로 음악을 돌리면서 악기를 등록하고 싶다면
	 * 쓰레드를 도입해야 합니다.
	 * 즉 독립적으로 동작하는 음악재생 프로그램이 필요합니다.
	 * 
	 * 물리적으로 CPU 가 지휘자인데, 효능이 좋은 CPU를 잘 활용하기 위해서는
	 * 기본 CPU를 제어하는 코드가 있어야 하고, 이 Class 를 Thread 라고
	 * 한다.
	 * 
	 * 현재까지는 작성된 모든 프로그램들은 하나의 main 쓰레드만 존재하였습니다.
	 * 그런데 앞으로는 다중으로 프로그램이 작동하면
	 * 대표적인 것이 게임상 유닛의 프로그램입니다.
	 */
}
